# Python SQL Tutorial

In this notebook, we will show you how to use Fugue SQL to work with SQL in a python environment. Fugue SQL is a SQL engine that can run on Spark, Dask, Ray, and Pandas. It is a SQL engine that is designed for data scientists and engineers and to be easy to use.
It also allows us to convert a Jupyter code cell into a SQL cell with the jupyter magic command ```%%fsql```.

DuckDB is an in-process SQL OLAP database management system. The speed is very good on even gigabytes of data on local machines. Fugue has a deep integration with DuckDB. Fugue not only uses DuckDB as the SQL engine, but also implemented all execution engine methods using DuckDB SQL and relations. So in most part of the workflow, the data tables are kept in DuckDB and in rare cases the tables will be materialized and converted to arrow dataframes. 

In this notebook you will learn how to create tables and insert data into the created tables.

In [2]:
import os
import duckdb
import pandas as pd
import sqlalchemy
import json
from fugue_notebook import setup
import fugue_duckdb

setup()

We have two csv files in our data directory:
- raw_orders.csv
- raw_payments.csv

and a json file:
- raw_customers.json


We will use pandas to load the data first:

In [3]:
df_customers = pd.read_json('data/raw_customers.json', orient='records', lines=True)
df_customers.head()

   id first_name last_name
0   1    Michael        P.
1   2      Shawn        M.
2   3   Kathleen        P.
3   4      Jimmy        C.
4   5  Katherine        R.

In [4]:
df_orders = pd.read_csv('data/raw_orders.csv')
df_orders.head()

   id  user_id  order_date     status
0   1        1  2018-01-01   returned
1   2        3  2018-01-02  completed
2   3       94  2018-01-04  completed
3   4       50  2018-01-05  completed
4   5       64  2018-01-05  completed

In [5]:
df_payment = pd.read_csv('data/raw_payments.csv')
df_payment.head()

   id  order_id payment_method  amount
0   1         1    credit_card    1000
1   2         2    credit_card    2000
2   3         3         coupon     100
3   4         4         coupon    2500
4   5         5  bank_transfer    1700

But we could do the same with fugue. With ```%%fsql``` we can convert the cell into a SQL cell and use fugue SQL to query the data. ```duck```  is the name of the execution engine which is DuckDB in our case.

With ```LOAD``` we can import our data and save it in a variable. We can use the variable name to query the data.

In [6]:
%%fsql duck

raw_customers = LOAD "data/raw_customers.json"

SELECT * FROM raw_customers
PRINT

As you can see you can load the data from various sources like csv, json, parquet, etc. and you can also load data from a database.

In [7]:
%%fsql duck

raw_orders = LOAD "data/raw_orders.csv" (header = "true")

SELECT * FROM raw_orders
PRINT

In [8]:
%%fsql duck

raw_payments = LOAD "data/raw_payments.csv" (header = "true")

SELECT * FROM raw_payments

PRINT

Now we can have a look at some questions. For example the RFM (Recency, Frequency, and Monetary) questions that are relevant for analysing customer behaviour. Here we can either load the data again with fugue or combine pandas and fugue and use fugue on top of pandas dataframes.

- When did the customers last purchase?

First we will join the orders and the customers table to get the customers name and the order date in one table and save it with ```YIELD``` in a dataframe ```df1``` that we can also use outside of this cell.

There are also ways to save the data in a database or as a files with ```SAVE```.

In [9]:
%%fsql

SELECT o.user_id, o.order_date, c.first_name, c.last_name FROM df_orders AS o
JOIN df_customers AS c
ON o.user_id = c.id
YIELD DATAFRAME AS df1

PRINT

Now we can write a python function that we can use with fugue in SQL. For that we have to define the schema first. Here we will use everything so we will use the ```*``` to select all columns. The schema is defined with a comment before the function.

In [10]:
#schema: *
def get_latest_order_date_per_customer(df: pd.DataFrame) -> pd.DataFrame:
    return df.sort_values('order_date', ascending=False).groupby('user_id').first().reset_index()

This python function will return the maximum date of the order date column. And can be used now in a fugue SQL query. For that we will use the ```TRANSFORM``` command. This command will apply the function to the dataframe. The function we want to use is defined by the ```USING``` command. The result will be saved in a new dataframe ```df2```.

In [11]:
%%fsql duck

df2 = TRANSFORM df1 USING get_latest_order_date_per_customer
YIELD DATAFRAME AS df2
PRINT

This Dataframe ```df2``` can than also be used again as a pandas DataFrame:

In [12]:
df2.head(5)

PandasDataFrame

## Exercise 1

-  What is the customer recency in days?

The answer to this question you can get from the previous table, by getting the date difference. Do this as an exercise.

In [13]:
from datetime import datetime

#schema: *, recency:int
def calculate_recency(df: pd.DataFrame) -> pd.DataFrame:
    df['recency'] = df['order_date'].apply(lambda x: (datetime.now() - datetime.strptime(x, "%Y-%m-%d")).days)
    return df

In [14]:
%%fsql

df_recency = TRANSFORM df2 USING calculate_recency
YIELD DATAFRAME AS df_recency
PRINT

The recency is quite large because the data is from 2018 ;)

-  How much did they spend?

To answer this question let us join all 3 tables together and save it in a dataframe ```df3```.

Additionally let's save the joined table as a parquet file for possible future use. Also we will see here that we can use global variables inside of fugue sql cells if we use double curly brackets ```{{}}``` around them.

In [15]:
PATH = os.path.join(os.getcwd())

In [16]:
%%fsql

SELECT o.user_id, c.first_name, c.last_name, p.amount FROM df_orders AS o
JOIN df_customers AS c
ON o.user_id = c.id
JOIN df_payment AS p
ON o.id = p.order_id
YIELD DATAFRAME AS df3

SAVE OVERWRITE "{{PATH}}/data/joined_data.parquet" 

PRINT

And now we can simply sum about the amount per customer:

In [17]:
%%fsql duck

SELECT first_name, last_name, SUM(amount) FROM df3
GROUP BY first_name, last_name
PRINT

## Exercise 2

Now you can try and answer the next questions as an exercise either you can write a python function that you apply with ```TRANSFORM``` or you can use the SQL to answer the questions.

- What is the most common payment method?

In [18]:
%%fsql

SELECT  p.payment_method, COUNT(*) AS method_count FROM df_payment AS p
GROUP BY p.payment_method
ORDER BY method_count DESC
PRINT

With python function and fugue's transform:

In [41]:
#schema: payment_method:str, count:int
def count_payment_methods(df: pd.DataFrame) -> pd.DataFrame:
    df = df['payment_method'].value_counts().reset_index()
    return df

In [43]:
%%fsql duck

df_payment_method_count = TRANSFORM df_payment USING count_payment_methods

PRINT

## Exercise 3

- Create a table that includes the aggregated data from the questions above!

In [21]:
%%fsql

SELECT  df2.user_id, 
        df2.first_name, 
        df2.last_name, 
        df2.order_date, 
        df3.amount,
        df_recency.recency
FROM df2
JOIN df3 ON df3.user_id = df2.user_id
JOIN df_recency ON df_recency.user_id = df2.user_id

PRINT